bench/results/s3_b0__.txt
Running 30s test @ http://origin-http:80/
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.54ms    1.19ms  34.41ms   78.30%
    Req/Sec    10.49k     1.28k   15.24k    66.92%
  Latency Distribution
     50%    1.27ms
     75%    2.04ms
     90%    2.98ms
     99%    5.54ms
  1253867 requests in 30.06s, 1.32GB read
Requests/sec:  41716.58
Transfer/sec:     45.11MB