bench/results/s3_ch__.txt
Running 30s test @ http://tunnel-server:18080/
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.51ms    1.79ms  26.05ms   71.66%
    Req/Sec     3.57k   346.17     4.42k    67.17%
  Latency Distribution
     50%    4.27ms
     75%    5.47ms
     90%    6.82ms
     99%    9.85ms
  426102 requests in 30.02s, 460.82MB read
Requests/sec:  14192.67
Transfer/sec:     15.35MB