bench/results/s3_ra__.txt
Running 30s test @ http://tunnel-server:18080/
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.95ms   17.12ms  45.86ms   31.54%
    Req/Sec     0.95k   427.62     4.72k    94.42%
  Latency Distribution
     50%   23.89ms
     75%   40.59ms
     90%   41.07ms
     99%   42.06ms
  113957 requests in 30.02s, 123.25MB read
Requests/sec:   3796.58
Transfer/sec:      4.11MB